Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/usci_b_i2c.c
        uint32_t timeout2 = timeout;

        //Send stop condition.
        HWREG8(baseAddress + OFS_UCBxCTL1) |= UCTXSTP;

        //Capture data from receive buffer after setting stop bit due to
        //MSP430 I2C critical timing.
        *rxData = (HWREG8(baseAddress + OFS_UCBxRXBUF));

        //Wait for Stop to finish
        while ((HWREG8(baseAddress + OFS_UCBxCTL1) & UCTXSTP) && --timeout) ;

        //Check if transfer timed out
        if (timeout == 0)
                return STATUS_FAIL;

        // Wait for RX buffer
        while ((!(HWREG8(baseAddress + OFS_UCBxIFG) & UCRXIFG)) && --timeout2) ;

        //Check if transfer timed out
        if (timeout2 == 0)
                return STATUS_FAIL;

        return STATUS_SUCCESS;
}

//*****************************************************************************
//
//! \brief Sends the STOP at the end of a multi-byte reception at the Master
//! end
//!
//! This function is used by the Master module to initiate STOP
//!
//! \param baseAddress is the base address of the I2C Master module.
//!
//! Modified bits are \b UCTXSTP of \b UCBxCTL1 register.
//!
//! \return None
//
//*****************************************************************************
void USCI_B_I2C_masterMultiByteReceiveStop(uint16_t baseAddress)
{
        //Send stop condition.
        HWREG8(baseAddress + OFS_UCBxCTL1) |= UCTXSTP;
}

//*****************************************************************************
//
//! \brief Initiates a single byte Reception at the Master End
//!
//! This function sends a START and STOP immediately to indicate Single byte
//! reception
//!
//! \param baseAddress is the base address of the I2C Master module.
//!
//! Modified bits are \b GIE of \b SR register; bits \b UCTXSTT and \b UCTXSTP
//! of \b UCBxCTL1 register.
//!
//! \return None
//
//*****************************************************************************
void USCI_B_I2C_masterSingleReceiveStart(uint16_t baseAddress)
{
        //local variable to store GIE status
        uint16_t gieStatus;

        //Store current SR register
        gieStatus = __get_SR_register() & GIE;

        //Disable global interrupt
        __disable_interrupt();

        //Set USCI in Receive mode
        HWREG8(baseAddress + OFS_UCBxCTL1) &= ~UCTR;

        //Send start condition.
        HWREG8(baseAddress + OFS_UCBxCTL1) |= UCTXSTT;

        //Poll for Start bit to complete
        while (HWREG8(baseAddress + OFS_UCBxCTL1) & UCTXSTT) ;

        //Send stop condition.
        HWREG8(baseAddress + OFS_UCBxCTL1) |= UCTXSTP;

        //Reinstate SR register
        __bis_SR_register(gieStatus);
}

//*****************************************************************************
//
//! \brief Initiates a single byte Reception at the Master End with timeout
//!
//! This function sends a START and STOP immediately to indicate Single byte
//! reception
//!
//! \param baseAddress is the base address of the I2C Master module.
//! \param timeout is the amount of time to wait until giving up
//!
//! Modified bits are \b GIE of \b SR register; bits \b UCTXSTT and \b UCTXSTP
//! of \b UCBxCTL1 register.
//!
//! \return STATUS_SUCCESS or STATUS_FAILURE of the transmission process.
//
//*****************************************************************************
bool USCI_B_I2C_masterSingleReceiveStartWithTimeout(uint16_t baseAddress,
                                                    uint32_t timeout
                                                    )
{
        //local variable to store GIE status
        uint16_t gieStatus;

        assert(timeout > 0);

        //Store current SR register
        gieStatus = __get_SR_register() & GIE;

        //Disable global interrupt
        __disable_interrupt();

        //Set USCI in Receive mode
        HWREG8(baseAddress + OFS_UCBxCTL1) &= ~UCTR;

        //Send start condition.
        HWREG8(baseAddress + OFS_UCBxCTL1) |= UCTXSTT;

        //Poll for Start bit to complete
        while ((!(HWREG8(baseAddress + OFS_UCBxIFG) & UCTXSTT)) && --timeout) ;

        //Check if transfer timed out
        if (timeout == 0)
                return STATUS_FAIL;

        //Send stop condition.
        HWREG8(baseAddress + OFS_UCBxCTL1) |= UCTXSTP;

        //Reinstate SR register
        __bis_SR_register(gieStatus);

        return STATUS_SUCCESS;
}

//*****************************************************************************
//
//! \brief Receives a byte that has been sent to the I2C Master Module.
//!
//! This function reads a byte of data from the I2C receive data Register.
//!
//! \param baseAddress is the base address of the I2C module.
//!
//! \return Returns the byte received from by the I2C module, cast as an
//!         uint8_t.
//
//*****************************************************************************
uint8_t USCI_B_I2C_masterSingleReceive(uint16_t baseAddress)
{
        //Polling RXIFG0 if RXIE is not enabled
        if (!(HWREG8(baseAddress + OFS_UCBxIE) & UCRXIE))
                while (!(HWREG8(baseAddress + OFS_UCBxIFG) & UCRXIFG)) ;

        //Read a byte.
        return HWREG8(baseAddress + OFS_UCBxRXBUF);
}

//*****************************************************************************
//
//! \brief Returns the address of the RX Buffer of the I2C for the DMA module.
//!
//! Returns the address of the I2C RX Buffer. This can be used in conjunction
//! with the DMA to store the received data directly to memory.
//!
//! \param baseAddress is the base address of the I2C module.
//!
//! \return the address of the RX Buffer
//
//*****************************************************************************
uint32_t USCI_B_I2C_getReceiveBufferAddressForDMA(uint16_t baseAddress)
{
        return baseAddress + OFS_UCBxRXBUF;
}

//*****************************************************************************
//
//! \brief Returns the address of the TX Buffer of the I2C for the DMA module.
//!
//! Returns the address of the I2C TX Buffer. This can be used in conjunction
//! with the DMA to obtain transmitted data directly from memory.
//!
//! \param baseAddress is the base address of the I2C module.
//!
//! \return the address of the TX Buffer
//
//*****************************************************************************
uint32_t USCI_B_I2C_getTransmitBufferAddressForDMA(uint16_t baseAddress)
{
        return baseAddress + OFS_UCBxTXBUF;
}


#endif
//*****************************************************************************
//
//! Close the doxygen group for usci_b_i2c_api
//! @}
//
//*****************************************************************************
